spring-petclinic/results/v1/jdk-17/jreports/graalvm-ee-jdk17-aggregate-report-run2.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Std. Dev.
Home Page,25000,3,3,8,11,19,0,58,"0,00%","19,6","59,1","3,82"
Vets Page,25000,4,3,8,11,18,1,367,"0,00%","19,6","78,6","4,80"
CSS,25000,18,12,30,50,120,6,150,"0,00%","19,6","3985,2","19,80"
JS,25000,7,6,13,17,35,2,63,"0,00%","19,6","1546,0","5,70"
POST New Owner,25000,20,8,18,28,429,2,1096,"0,00%","19,6","72,6","84,44"
POST New Owner-0,25000,15,4,11,18,386,1,1055,"0,00%","19,6","3,7","80,94"
POST New Owner-1,25000,4,3,8,12,29,1,367,"0,00%","19,6","69,0","10,55"
GET Owner,25000,7,4,9,13,94,1,729,"0,00%","19,6","69,0","32,10"
GET Find Owner,25000,3,3,7,10,17,1,60,"0,00%","19,6","69,7","3,25"
"GET Find Owner with lastname=""""",25000,164,113,349,578,1107,7,1328,"0,00%","19,6","3316,7","195,82"
POST Update Owner,25000,31,8,21,126,668,3,1093,"0,00%","19,6","72,9","106,44"
POST Update Owner-0,25000,25,5,13,102,626,1,1013,"0,00%","19,6","3,7","99,14"
POST Update Owner-1,25000,5,3,8,13,37,1,725,"0,00%","19,6","69,2","19,79"
POST New Pet,25000,11,8,16,21,71,2,838,"0,00%","19,6","86,8","30,93"
POST New Pet-0,25000,6,4,8,12,47,1,753,"0,00%","19,6","3,7","19,99"
POST New Pet-1,25000,5,4,8,11,24,1,410,"0,00%","19,6","83,1","14,92"
GET New Pet,25000,10,6,12,18,196,2,566,"0,00%","19,6","94,1","31,86"
TOTAL,425000,20,5,20,88,375,0,1328,"0,00%","332,5","9662,0","77,09"